O processo de limpeza e preparaçao dos dados é a etapa mais importante a ser realizada antes de iniciar qualquer analise. Ele representa cerca de 75% do trabalho de um cientista de dados; ele pode ser custoso. Nesta etapa é realizada a limpeza e a preparação das informações que temos em maos. isso significa o que? Que o cientista de dados ira verificar: 

*   Os tipos de dados ( se a base de dados contem volores de tipo numericos/categoricos) 
*   Verificar se os dados estão faltando 
*   descobrir se existem  valores na nossa base de dado que podem alterar o  resultado
* verificar se alguns dados podem ser transformados?
* verificar se alguns dados estao duplicados?

Nesse post, iremos abordar algumas tecnicas para tratamento e limpeza das informações utilizando o Pandas, uma biblioteca da linguagem Python.

vamos utilizar o [google colab](https://colab.research.google.com/) para realizar a nossa tarefa.

In [ ]:
import pandas as pd
import numpy as np

# **Vamos Criar um dicionário em Python para amezenar as notas dos alunos que fizeram uma prova no Brasil.**

In [ ]:
dic = { 'Aluno' :      ['Dietrich','hans','hans','mel','Samuel','junior'] ,
        'Matematica' : [5,4,4,6,5,7],
        'Historia' :   [7,7,7,np.nan,0,1],
        'Geografia' :  [np.nan,np.nan,np.nan,12,4,5],
        'informatica': [9,np.nan,np.nan,np.nan,5,7.5],
        'programaçao': [2,5,5,10,8,3],
        'Desafio' :    [1,7,7,9,4,4.6],
        'Tarefa' :     [10,11,11,12,np.nan,5,],
        'Pais' :       ['BRASIL','BRASIL','BRASIL','BRASIL','BRASIL','BRASIL'] }

# **Addicionando o dicionário que foi criado anterioramente num DataFrame(uma Tabela)**.

In [ ]:
notas = pd.DataFrame(dic)

# **Imprimindo a nossa Tabela(metodo 1)**

In [ ]:
notas

      Aluno  Matematica  Historia  ...  Desafio  Tarefa    Pais
0  Dietrich           5       7.0  ...      1.0    10.0  BRASIL
1      hans           4       7.0  ...      7.0    11.0  BRASIL
2      hans           4       7.0  ...      7.0    11.0  BRASIL
3       mel           6       NaN  ...      9.0    12.0  BRASIL
4    Samuel           5       0.0  ...      4.0     NaN  BRASIL
5    junior           7       1.0  ...      4.6     5.0  BRASIL

[6 rows x 9 columns]

# **Imprimindo a nossa Tabela(metodo 2)**

In [ ]:
# esse è a forma padrao para imprimir o Dataframe .(ometodo 'head()' retorna as  5 primeiras linhas da Tabela )
notas.head()

      Aluno  Matematica  Historia  ...  Desafio  Tarefa    Pais
0  Dietrich           5       7.0  ...      1.0    10.0  BRASIL
1      hans           4       7.0  ...      7.0    11.0  BRASIL
2      hans           4       7.0  ...      7.0    11.0  BRASIL
3       mel           6       NaN  ...      9.0    12.0  BRASIL
4    Samuel           5       0.0  ...      4.0     NaN  BRASIL

[5 rows x 9 columns]

# **Imprimindo as 2 primeiras linhas da nossa Tabela**

In [ ]:
#Basta passar o numeros de linhas que voce quer visualizar no metodo head()
notas.head(2)

      Aluno  Matematica  Historia  ...  Desafio  Tarefa    Pais
0  Dietrich           5       7.0  ...      1.0    10.0  BRASIL
1      hans           4       7.0  ...      7.0    11.0  BRASIL

[2 rows x 9 columns]

# **Removendo colunas do DataFrame**

Por exemplo a colunas "Pais" nao tem nenhuma relevancia na nossa B pois o objetivo aqui é trabalhar apenas com as notas dos alunos entao vamos eliminar essa coluna.

**Como eliminar uma coluna do DataFrame usando Python?**
a biblioteca **Pandas** disponibiliza o método **drop()** para remover linhas e colunas da tabela.

In [ ]:
# excluindo a coluna 'Pais'
notas.drop('Pais', inplace=True, axis=1)

Dentro do metodo **drop()** passamos 3 Parametros que sao :
**'Pais'** que é a coluna que queremos excluir , o segundo parametro **inplace=True** indica que a alteraçao irá ocorrer no DataFrame original de forma a nao criar outras copias de DataFrame, **axis=1** indica que a exclusao sera aplicada na coluna que passamos no metodo **drop()**.

In [ ]:
# vamos verificar se a coluna Pais foi realmente excluida 
notas.head()

      Aluno  Matematica  Historia  ...  programaçao  Desafio  Tarefa
0  Dietrich           5       7.0  ...            2      1.0    10.0
1      hans           4       7.0  ...            5      7.0    11.0
2      hans           4       7.0  ...            5      7.0    11.0
3       mel           6       NaN  ...           10      9.0    12.0
4    Samuel           5       0.0  ...            8      4.0     NaN

[5 rows x 8 columns]

# **Verificando linhas duplicadas**

Basta usar o metodo **.duplicated()** Ele retorna True quando há uma linha duplicada

In [ ]:
notas.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

# **Excluindo linhas duplicadas**

O metodo **drop_duplicates()** permite elimar as linhas duplicadas no DataFrame

In [ ]:
# Eliminando linhas duplicadas
notas = notas.drop_duplicates()
notas

      Aluno  Matematica  Historia  ...  programaçao  Desafio  Tarefa
0  Dietrich           5       7.0  ...            2      1.0    10.0
1      hans           4       7.0  ...            5      7.0    11.0
3       mel           6       NaN  ...           10      9.0    12.0
4    Samuel           5       0.0  ...            8      4.0     NaN
5    junior           7       1.0  ...            3      4.6     5.0

[5 rows x 8 columns]

# **Identificando de dados ausentes (dados faltantes)**

O que são Dados ausentes? são valores representados pelo valor de ponto flutuante [NaN](https://pt.wikipedia.org/wiki/NaN) (acrônimo em inglês para **Not** **a** **Number**) significa que um determinado compo está vazio no nosso DataFrame. podem ter NaN quando acontece um erro durante a coleta dos dados,  erros de processamento ou outros inúmeros fatores.

**Como identificar valores NaN ?** Basta usar o metodo **isnull()** ele retornará **True** caso encontre valores do tipo **NaN** ou seja quando um campo está vazio.

In [ ]:
# identificando os valores NaN na nossa Tabela.
notas.isnull()

   Aluno  Matematica  Historia  ...  programaçao  Desafio  Tarefa
0  False       False     False  ...        False    False   False
1  False       False     False  ...        False    False   False
3  False       False      True  ...        False    False   False
4  False       False     False  ...        False    False    True
5  False       False     False  ...        False    False   False

[5 rows x 8 columns]

# **Visualizando Melhore os valores NaN**

Para visualizar melhore os valores **NaN** vamos usar o metodo **isnull().sum()**. Esse metodo retorna o **total de valores** **NaN** **em** **cada coluna**

In [ ]:
# visualiando  o total de valores NaN em cada coluna
notas.isnull().sum()

Aluno          0
Matematica     0
Historia       1
Geografia      2
informatica    2
programaçao    0
Desafio        0
Tarefa         1
dtype: int64

# **Filtrando os valores nulos NaN**

Usaremos o metodo **dropna()**, que permite que somente as linhas  contendo um valor ausente (NaN) sejam eliminadas . Esse metodo é aplicado quando queremos que a Base de dados seja tratada eliminando todos os valores **NaN**

In [ ]:
# eliminando todas as linhas com valores NaN
notas.dropna()

    Aluno  Matematica  Historia  ...  programaçao  Desafio  Tarefa
5  junior           7       1.0  ...            3      4.6     5.0

[1 rows x 8 columns]

# **Retorna as linhas onde todos os elementos estão ausentes**

Vamos usar o parâmetro **how='all'** Retorna as linhas onde todos os elementos estão ausentes

In [ ]:
# Retorna as linhas onde todos os elementos estão ausentes
notas.dropna(how='all')

      Aluno  Matematica  Historia  ...  programaçao  Desafio  Tarefa
0  Dietrich           5       7.0  ...            2      1.0    10.0
1      hans           4       7.0  ...            5      7.0    11.0
3       mel           6       NaN  ...           10      9.0    12.0
4    Samuel           5       0.0  ...            8      4.0     NaN
5    junior           7       1.0  ...            3      4.6     5.0

[5 rows x 8 columns]

# **Como Preencher valores nulos**

**há várias maneiras de preencher valores nulos**

**1-** Usando o metodo **fillna()** voce pode passar um **valor** que irá substituir o  **NaN** na Tabela



```
notas.fillna(0)
```



```
#Saida

	Aluno	Matematica	Historia	Geografia	informatica	programaçao	Desafio	Tarefa	Pais
0	Dietrich	5	7.0	0.0	9.0	2	1.0	10.0	BRASIL
1	hans	4	7.0	0.0	0.0	5	7.0	11.0	BRASIL
2	mel	6	0.0	12.0	0.0	10	9.0	12.0	BRASIL
3	Samuel	5	0.0	4.0	5.0	8	4.0	0.0	BRASIL
4	junior	7	1.0	5.0	7.5	3	4.6	5.0	BRASIL
```

**2-** Prenchendo com a mediana de cada coluna usando o **metodo mean()**



```
notas.fillna(notas.median())
```



```
# saida

Aluno	Matematica	Historia	Geografia	informatica	programaçao	Desafio	Tarefa	Pais
0	Dietrich	5	7.0	5.0	9.0	2	1.0	10.0	BRASIL
1	hans	4	7.0	5.0	7.5	5	7.0	11.0	BRASIL
2	mel	6	4.0	12.0	7.5	10	9.0	12.0	BRASIL
3	Samuel	5	0.0	4.0	5.0	8	4.0	10.5	BRASIL
4	junior	7	1.0	5.0	7.5	3	4.6	5.0	BRASIL	
```

**3-** Prenchendo com a **media** de cada coluna usando o metodo **mean()**

In [ ]:
notas.fillna(notas.mean())

      Aluno  Matematica  Historia  ...  programaçao  Desafio  Tarefa
0  Dietrich           5      7.00  ...            2      1.0    10.0
1      hans           4      7.00  ...            5      7.0    11.0
3       mel           6      3.75  ...           10      9.0    12.0
4    Samuel           5      0.00  ...            8      4.0     9.5
5    junior           7      1.00  ...            3      4.6     5.0

[5 rows x 8 columns]

# **Alterando o índice do DataFrame**

Vamos substituir o índice pela coluna **Aluno**. Para teremos o método **set_index() ** que permite realizar essa modificação.

In [ ]:
# definido Aluno como index do DataFrame 
notas.set_index('Aluno', inplace=True)

In [ ]:
notas.head()

          Matematica  Historia  Geografia  ...  programaçao  Desafio  Tarefa
Aluno                                      ...
Dietrich           5       7.0        NaN  ...            2      1.0    10.0
hans               4       7.0        NaN  ...            5      7.0    11.0
mel                6       NaN       12.0  ...           10      9.0    12.0
Samuel             5       0.0        4.0  ...            8      4.0     NaN
junior             7       1.0        5.0  ...            3      4.6     5.0

[5 rows x 7 columns]

Agora com o index do DataFrame redefinido podemos accesar de forma rapida os dados(notas) de cada aluno usando o metodo **.loc**

In [ ]:
#visualizando as notas do Aluno junior
notas.loc['junior']

Matematica     7.0
Historia       1.0
Geografia      5.0
informatica    7.5
programaçao    3.0
Desafio        4.6
Tarefa         5.0
Name: junior, dtype: float64